Revit 2027 API
AlignmentStationLabel.IsValid Method
 Checks if this object is a valid alignment station label.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValid()
Public Function IsValid As Boolean
public:
bool IsValid()
member IsValid : unit -> bool
Return Value
Boolean
See Also
Reference
AlignmentStationLabel Class
IsValid Overload
Autodesk.Revit.DB.Infrastructure Namespace